ode-soap-performance/bpelContent/ArithmeticProgression.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/ArithmeticProgression/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.wscomposition.org/ArithmeticProgression/" name="ArithmeticProgression">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.wscomposition.org/ArithmeticProgression/" schemaLocation="ArithmeticProgression.xsd"></xsd:import>
        </xsd:schema>
    </types>
    <message name="ArithmeticProgressionRequest">
        <part name="n" type="xsd:int"></part>
        <part name="a" type="xsd:int"></part>
        <part name="d" type="xsd:int"></part>
    </message>
    <message name="ArithmeticProgressionRequestResponse">
        <part name="return" type="tns:arithmeticProgressionResponse"></part>
    </message>
    <portType name="ArithmeticProgressionServiceImpl">
        <operation name="ArithmeticProgressionRequest" parameterOrder="n a d">
            <input wsam:Action="http://www.wscomposition.org/ArithmeticProgression/ArithmeticProgressionServiceImpl/ArithmeticProgressionRequestRequest" message="tns:ArithmeticProgressionRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/ArithmeticProgression/ArithmeticProgressionServiceImpl/ArithmeticProgressionRequestResponse" message="tns:ArithmeticProgressionRequestResponse"></output>
        </operation>
    </portType>
    <binding name="ArithmeticProgressionSOAPBinding" type="tns:ArithmeticProgressionServiceImpl">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
        <operation name="ArithmeticProgressionRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/ArithmeticProgression/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/ArithmeticProgression/"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="ArithmeticProgression">
        <port name="ArithmeticProgressionSOAP" binding="tns:ArithmeticProgressionSOAPBinding">
            <soap:address location="http://localhost:9001/ArithmeticProgression"></soap:address>
        </port>
    </service>
</definitions>